# CSDA1000: Week 2 Assignment

## Name: Qing Ma

## Student No.: 302304

## Objectives: 
###        1. Assign variables
###        2. Perform built in comparison and mathematical functions
###        3. Use several native Python functions (e.g., range(), help())
###        4. Loop over a list and print to the console
###        5. Import Pandas
###        6. Create a dataframe with a few columns and rows.
###        7. Index a pandas data frame and print different cells, rows, columns, etc.

----------------------------------------------------------------------------------------

## Assign variables

In [1]:
x = 5
y = 4
print "x+y=", x+y
print "Variables can be overwrited"
x = "Hello "
y = "World"
print "x+y is ", x+y

x+y= 9
Variables can be overwrited
x+y is  Hello World

## Perform built in comparison and mathematical functions

In [2]:
x = 3
y = 5
print "x is", x, "y is", y
print "x is equal to y?", x == y
print "x is NOT equal to y?", x != y
print "x is less than y?", x < y
print "x is greater than y?", x > y
print "x is less than or equal to y?", x <= y
print "x is greater than or equal to y?", x >= y

x is 3 y is 5
x is equal to y? False
x is NOT equal to y? True
x is less than y? True
x is greater than y? False
x is less than or equal to y? True
x is greater than or equal to y? False

In [3]:
pi = 3.141592653
print "The integer part of pi is", round(pi)
print "We usually use pi with two decimal places, which is", round(pi, 2)

The integer part of pi is 3.0
We usually use pi with two decimal places, which is 3.14

In [4]:
print "In ASCII the difference between Lower case letter and up case letter is", ord("a") - ord("A")
dif = ord("a") - ord("A")
upper = 'F'
lower = chr(ord(upper) + dif)
print "lower case of 'F' is " , lower

In ASCII the difference between Lower case letter and up case letter is 32
lower case of 'F' is  f

In [5]:
print "Conjugate comples numbers have the same magnitude, then "
X1 = complex(3 + 4j)
X2 = complex(3 - 4j)
print "the magnitude of X1 is %.1f" % abs(X1)
print "the magnitude of X2 is %.1f" % abs(X2)
X = (abs(X1) == abs(X2))
print "therefore the statement above is", X

Conjugate comples numbers have the same magnitude, then
the magnitude of X1 is 5.0
the magnitude of X2 is 5.0
therefore the statement above is True

In [6]:
x = 1
y = 2
print cmp(x, y), "because x < y"
x = x + 1
print cmp(x, y), "because x == y"
x = x + 1
print cmp(x, y), "because x > y"

-1 because x < y
0 because x == y
1 because x > y

In [7]:
from IPython.display import display, Markdown, Latex
display(Markdown("$2^{10}$"))
print "is", pow(2, 10)

$2^{10}$

is 1024

## Native Python functions

In [8]:
print("How to use the help() function")
print("help(function name)")
help("print")

How to use the help() function
help(function name)
The "print" statement
*********************

   print_stmt ::= "print" ([expression ("," expression)* [","]]
                  | ">>" expression [("," expression)+ [","]])

"print" evaluates each expression in turn and writes the resulting
object to standard output (see below).  If an object is not a string,
it is first converted to a string using the rules for string
conversions.  The (resulting or original) string is then written.  A
space is written before each object is (converted and) written, unless
the output system believes it is positioned at the beginning of a
line.  This is the case (1) when no characters have yet been written
to standard output, (2) when the last character written to standard
output is a whitespace character except "' '", or (3) when the last
write operation on standard output was not a "print" statement. (In
some cases it may be functional to write an empty string to standard
output for this reason.)

Note: Objects which act like file objects but which are not the
  built-in file objects often do not properly emulate this aspect of
  the file object's behavior, so it is best not to rely on this.

A "'\n'" character is written at the end, unless the "print" statement
ends with a comma.  This is the only action if the statement contains
just the keyword "print".

Standard output is defined as the file object named "stdout" in the
built-in module "sys".  If no such object exists, or if it does not
have a "write()" method, a "RuntimeError" exception is raised.

"print" also has an extended form, defined by the second portion of
the syntax described above. This form is sometimes referred to as
""print" chevron." In this form, the first expression after the ">>"
must evaluate to a "file-like" object, specifically an object that has
a "write()" method as described above.  With this extended form, the
subsequent expressions are printed to this file object.  If the first
expression evaluates to "None", then "sys.stdout" is used as the file
for output.

In [9]:
# range() returns a list of numbers with given length, starting point, end point, and step
length = 9
start = 1
end = 10
step = 2
print range(length)
print range(start, end)
print range(start, end, step)

[0, 1, 2, 3, 4, 5, 6, 7, 8]
[1, 2, 3, 4, 5, 6, 7, 8, 9]
[1, 3, 5, 7, 9]

In [10]:
String = "My name is Qing Ma"
ID = 302304
print("%s, and my student number is %d" %(String, ID))

My name is Qing Ma, and my student number is 302304

In [11]:
H = ['a', 'b12', 'c3', 'd4', 'e55', 'f666', 'g7', 'h78', 'i9']
print "The length of the list is", len(H)
L = list()
L = H
print "The minimum of the list is", min(H)
print "The maximum of the list is", max(H)
print "The longest element in the list is", max(L, key = len)
print "The shortest element in the list is", min(L, key = len)

The length of the list is 9
The minimum of the list is a
The maximum of the list is i9
The longest element in the list is f666
The shortest element in the list is a

### LIST

In [12]:
L = list("Big")
print L
H = list("Data")
LH = L + [" "] + H
print LH
l = ''.join(LH)
print l

['B', 'i', 'g']
['B', 'i', 'g', ' ', 'D', 'a', 't', 'a']
Big Data

In [13]:
print "How many 'a' in the list l? ", l.count('a')

How many 'a' in the list l?  2

In [14]:
print "What is the position of 'D' in the list l? ", l.index('D')

What is the position of 'D' in the list l?  4

In [15]:
LH.insert(0, "Welcome to")
print LH

['Welcome to', 'B', 'i', 'g', ' ', 'D', 'a', 't', 'a']

In [16]:
LH.append('')
LH[len(LH)-1] = '!'
LH

['Welcome to', 'B', 'i', 'g', ' ', 'D', 'a', 't', 'a', '!']

In [17]:
print "The length befor pop() is", len(LH)
print LH.pop()
print "The length after pop() is", len(LH)

The length befor pop() is 10
!
The length after pop() is 9

In [18]:
LH.remove('Welcome to')
print LH

['B', 'i', 'g', ' ', 'D', 'a', 't', 'a']

In [19]:
del LH[3]
print "delete the space in the list: ", LH

delete the space in the list:  ['B', 'i', 'g', 'D', 'a', 't', 'a']

In [20]:
LH.reverse()
print LH

['a', 't', 'a', 'D', 'g', 'i', 'B']

In [21]:
LH.sort()
print LH
LH.sort(reverse = True)
print LH

['B', 'D', 'a', 'a', 'g', 'i', 't']
['t', 'i', 'g', 'a', 'a', 'D', 'B']

In [22]:
L1 = list('Hello')
L2 = L1
L3 = L1[:]
L1.extend(" World")
print "L1 is\t", L1
print "L2 copies the reference of L1, so it is the same as L1:\n\t", L2
print "L3 copies the origianl contents of L1, so it does not change:\n\t", L3

L1 is	['H', 'e', 'l', 'l', 'o', ' ', 'W', 'o', 'r', 'l', 'd']
L2 copies the reference of L1, so it is the same as L1:
	['H', 'e', 'l', 'l', 'o', ' ', 'W', 'o', 'r', 'l', 'd']
L3 copies the origianl contents of L1, so it does not change:
	['H', 'e', 'l', 'l', 'o']

### TUPLES

In [23]:
T = tuple()
T = ()
print "T is an empty tuple:", T

T is an empty tuple: ()

In [24]:
T1 = tuple("Hi")
T2 = 3 * T1
print T2
T1 = tuple([1, 2, 3])
T3 = 3 * T1
print T3

('H', 'i', 'H', 'i', 'H', 'i')
(1, 2, 3, 1, 2, 3, 1, 2, 3)

In [25]:
a = T2[2:4]
print a
b = T3[3]
print b

('H', 'i')
1

In [26]:
(d, m, y) = ('Day', 'Month', 'year')
print d, m, y

Day Month year

In [27]:
H = tuple('HelloWorld')
print H
print "How many 'o' in the tuple?", H.count('o')
print "where is the letter 'W' in the tuple?", H.index('W')

('H', 'e', 'l', 'l', 'o', 'W', 'o', 'r', 'l', 'd')
How many 'o' in the tuple? 2
where is the letter 'W' in the tuple? 5

## SETS

In [28]:
S = set()
print "S is an empty set: ", S

S is an empty set:  set([])

In [29]:
S1 = set(['a', 'b', 'c', 'd', 'a', 'e', 'd', 'b', 'b'])
print "each element in a set is unique, so S1 is\n\t", S1

S2 = set(['c', 'f', 'c', 'j', 'd', 'c', 'e', 'c', 'd'])

S = S.union(S1)
S = S.union(S2)
print "S is the union of set S1 and S2: \n\t", S

S.add('h')
print "add h to the set: \n\t", S

S3 = S1.intersection(S2)
print "The intersection of S1 and S2 is:\n\t", S3

S4 = S1.difference(S2)
print "The elements that are in S1 but not in S2:\n\t" , S4

S5 = S1.symmetric_difference(S2)
print "The elements that are not shared by S1 and S2\n\t", S5

each element in a set is unique, so S1 is
	set(['a', 'c', 'b', 'e', 'd'])
S is the union of set S1 and S2:
	set(['a', 'c', 'b', 'e', 'd', 'f', 'j'])
add h to the set:
	set(['a', 'c', 'b', 'e', 'd', 'f', 'h', 'j'])
The intersection of S1 and S2 is:
	set(['c', 'e', 'd'])
The elements that are in S1 but not in S2:
	set(['a', 'b'])
The elements that are not shared by S1 and S2
	set(['a', 'b', 'f', 'j'])

In [30]:
print "Check if S is the superset of S1?", S.issuperset(S1)
print "Check if S1 disjoint of S2?", S1.isdisjoint(S2)
print "Check if S2 is subset of S?", S2.issubset(S)

Check if S is the superset of S1? True
Check if S1 disjoint of S2? False
Check if S2 is subset of S? True

## Loop over a list and print to the console

In [31]:
s = 0
for x in range(10):
    print x
    s = s+x
print "The average of those numbers is", s / 10.0

0
1
2
3
4
5
6
7
8
9
The average of those numbers is 4.5

Below we create a 4x4 list, and fill it up with random integers between 0 to 100

In [32]:
import random
X = [[] for row in range(4)]
for i in range(4):
    for j in range(4):
        r = int(random.random() * 100)
        X[i].append(r)
print X

[[18, 53, 39, 90], [35, 4, 90, 67], [8, 57, 19, 82], [20, 71, 50, 4]]

In [33]:
i = 0
while i < len(X):
    print X[i]
    i = i+1
    
print "\nThe summation of each row is:"

i = 0
while i < len(X):
    print X[i], "SUM =", sum(X[i])
    i = i+1

print "\n"
i = 0
j = 0
s = 0
while i < len(X):
    j = 0
    while j < len(X[i]):
        print "\t", X[i][j], 
        s = s + X[i][j]
        j = j+1
    print "\n"
    i = i+1
print "The summation of the whole list:", s

[18, 53, 39, 90]
[35, 4, 90, 67]
[8, 57, 19, 82]
[20, 71, 50, 4]

The summation of each row is:
[18, 53, 39, 90] SUM = 200
[35, 4, 90, 67] SUM = 196
[8, 57, 19, 82] SUM = 166
[20, 71, 50, 4] SUM = 145


	18 	53 	39 	90

	35 	4 	90 	67

	8 	57 	19 	82

	20 	71 	50 	4

The summation of the whole list: 707

## Import Pandas

In [34]:
import pandas as pd
import datetime

## Create a dataframe with a few columns and rows

In [35]:
# create a list containing years form 1984 to 2016
start = datetime.datetime(1984, 01, 01)
end = datetime.datetime(2016, 12, 31)
step = datetime.timedelta(days = 4 * 365 + 1)
year = []

In [36]:
while start < end:
    year.append(start.strftime('%Y'))
    start = start + step
year

['1984', '1988', '1992', '1996', '2000', '2004', '2008', '2012', '2016']

In [37]:
m = {'Year': year, 'Gold': [15, 5, 16, 16, 28, 32, 51, 38, 26], 'Silver': [8, 11, 22, 22, 16, 17, 21, 27, 18], 'Bronze': [9, 12, 16, 12, 14, 14, 28, 23, 26]}
m

{'Bronze': [9, 12, 16, 12, 14, 14, 28, 23, 26],
 'Gold': [15, 5, 16, 16, 28, 32, 51, 38, 26],
 'Silver': [8, 11, 22, 22, 16, 17, 21, 27, 18],
 'Year': ['1984',
  '1988',
  '1992',
  '1996',
  '2000',
  '2004',
  '2008',
  '2012',
  '2016']}

In [38]:
medals = pd.DataFrame(m, columns = ['Year', 'Gold', 'Silver', 'Bronze'])
medals

   Year  Gold  Silver  Bronze
0  1984    15       8       9
1  1988     5      11      12
2  1992    16      22      16
3  1996    16      22      12
4  2000    28      16      14
5  2004    32      17      14
6  2008    51      21      28
7  2012    38      27      23
8  2016    26      18      26

In [39]:
nGold = medals['Gold']
print nGold

0    15
1     5
2    16
3    16
4    28
5    32
6    51
7    38
8    26
Name: Gold, dtype: int64

In [40]:
medals = medals.set_index('Year')

In [41]:
medals

      Gold  Silver  Bronze
Year
1984    15       8       9
1988     5      11      12
1992    16      22      16
1996    16      22      12
2000    28      16      14
2004    32      17      14
2008    51      21      28
2012    38      27      23
2016    26      18      26

In [42]:
medals.loc['1988']

Gold       5
Silver    11
Bronze    12
Name: 1988, dtype: int64

In [43]:
# data frame from a .csv file
drinks = pd.read_csv('../data/drinks.csv')
print drinks

                  country  beer_servings  spirit_servings  wine_servings  \
0             Afghanistan              0                0              0
1                 Albania             89              132             54
2                 Algeria             25                0             14
3                 Andorra            245              138            312
4                  Angola            217               57             45
5       Antigua & Barbuda            102              128             45
6               Argentina            193               25            221
7                 Armenia             21              179             11
8               Australia            261               72            212
9                 Austria            279               75            191
10             Azerbaijan             21               46              5
11                Bahamas            122              176             51
12                Bahrain             42               63              7
13             Bangladesh              0                0              0
14               Barbados            143              173             36
15                Belarus            142              373             42
16                Belgium            295               84            212
17                 Belize            263              114              8
18                  Benin             34                4             13
19                 Bhutan             23                0              0
20                Bolivia            167               41              8
21     Bosnia-Herzegovina             76              173              8
22               Botswana            173               35             35
23                 Brazil            245              145             16
24                 Brunei             31                2              1
25               Bulgaria            231              252             94
26           Burkina Faso             25                7              7
27                Burundi             88                0              0
28          Cote d'Ivoire             37                1              7
29             Cabo Verde            144               56             16
..                    ...            ...              ...            ...
163              Suriname            128              178              7
164             Swaziland             90                2              2
165                Sweden            152               60            186
166           Switzerland            185              100            280
167                 Syria              5               35             16
168            Tajikistan              2               15              0
169              Thailand             99              258              1
170             Macedonia            106               27             86
171           Timor-Leste              1                1              4
172                  Togo             36                2             19
173                 Tonga             36               21              5
174     Trinidad & Tobago            197              156              7
175               Tunisia             51                3             20
176                Turkey             51               22              7
177          Turkmenistan             19               71             32
178                Tuvalu              6               41              9
179                Uganda             45                9              0
180               Ukraine            206              237             45
181  United Arab Emirates             16              135              5
182        United Kingdom            219              126            195
183              Tanzania             36                6              1
184                   USA            249              158             84
185               Uruguay            115               35            220
186            Uzbekistan             25              101              8
187               Vanuatu             21               18             11
188             Venezuela            333              100              3
189               Vietnam            111                2              1
190                 Yemen              6                0              0
191                Zambia             32               19              4
192              Zimbabwe             64               18              4

     total_litres_of_pure_alcohol continent
0                             0.0        AS
1                             4.9        EU
2                             0.7        AF
3                            12.4        EU
4                             5.9        AF
5                             4.9       NAm
6                             8.3        SA
7                             3.8        EU
8                            10.4        OC
9                             9.7        EU
10                            1.3        EU
11                            6.3       NAm
12                            2.0        AS
13                            0.0        AS
14                            6.3       NAm
15                           14.4        EU
16                           10.5        EU
17                            6.8       NAm
18                            1.1        AF
19                            0.4        AS
20                            3.8        SA
21                            4.6        EU
22                            5.4        AF
23                            7.2        SA
24                            0.6        AS
25                           10.3        EU
26                            4.3        AF
27                            6.3        AF
28                            4.0        AF
29                            4.0        AF
..                            ...       ...
163                           5.6        SA
164                           4.7        AF
165                           7.2        EU
166                          10.2        EU
167                           1.0        AS
168                           0.3        AS
169                           6.4        AS
170                           3.9        EU
171                           0.1        AS
172                           1.3        AF
173                           1.1        OC
174                           6.4       NAm
175                           1.3        AF
176                           1.4        AS
177                           2.2        AS
178                           1.0        OC
179                           8.3        AF
180                           8.9        EU
181                           2.8        AS
182                          10.4        EU
183                           5.7        AF
184                           8.7       NAm
185                           6.6        SA
186                           2.4        AS
187                           0.9        OC
188                           7.7        SA
189                           2.0        AS
190                           0.1        AS
191                           2.5        AF
192                           4.7        AF

[193 rows x 6 columns]

In [44]:
print drinks.continent.value_counts()

AF     53
EU     45
AS     44
NAm    23
OC     16
SA     12
Name: continent, dtype: int64

In [45]:
drinks.head(7)
# by default it shows the first 5 rows, we can specify the number of rows

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF
5,Antigua & Barbuda,102,128,45,4.9,NAm
6,Argentina,193,25,221,8.3,SA

In [46]:
drinks.tail(3)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
190,Yemen,6,0,0,0.1,AS
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

### Import Series, DataFrame, and plot

In [47]:
import pandas as pd
from pandas import Series, DataFrame
import matplotlib.pyplot as plt
plt.rc('figure', figsize =(10, 6))
PREVISOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20

### Series

In [48]:
srs = pd.Series([-2, -3, 0, 4, 7])
srs

0   -2
1   -3
2    0
3    4
4    7
dtype: int64

In [49]:
srs.values

array([-2, -3,  0,  4,  7], dtype=int64)

In [50]:
srs.index

RangeIndex(start=0, stop=5, step=1)

In [51]:
srs1 = pd.Series([-2, -3, 0, 4, 7], index = ['a', 'b', 'c', 'd', 'e'])
srs1

a   -2
b   -3
c    0
d    4
e    7
dtype: int64

In [52]:
srs1.index

Index([u'a', u'b', u'c', u'd', u'e'], dtype='object')

In [53]:
# update by using index
print srs1
srs1['c'] = 99
print srs1

a   -2
b   -3
c    0
d    4
e    7
dtype: int64
a    -2
b    -3
c    99
d     4
e     7
dtype: int64

In [54]:
srs1[['a', 'c', 'e']]

a    -2
c    99
e     7
dtype: int64

In [55]:
srs1[srs1<0]

a   -2
b   -3
dtype: int64

In [56]:
srs1 * (-1)

a     2
b     3
c   -99
d    -4
e    -7
dtype: int64

In [57]:
# check if index in the series
print 'a' in srs1
print 'z' in srs1

True
False

In [58]:
# convert dictionary to series
sdata = {'YorkU': 40000, 'UofT': 60000, 'Ryerson': 25000, 'UOIT': 35000}
srs2 = pd.Series(sdata)
srs2

Ryerson    25000
UOIT       35000
UofT       60000
YorkU      40000
dtype: int64

In [59]:
universities = ['UBC', 'YorkU', 'UofT', 'UOIT']
srs3 = pd.Series(sdata, index = universities)
srs3

UBC          NaN
YorkU    40000.0
UofT     60000.0
UOIT     35000.0
dtype: float64

In [60]:
# check if any index in series is empty
print pd.isnull(srs3)
# check if any index in series is NOT empty
print pd.notnull(srs3)

UBC       True
YorkU    False
UofT     False
UOIT     False
dtype: bool
UBC      False
YorkU     True
UofT      True
UOIT      True
dtype: bool

In [61]:
# same as above
srs3.isnull()
srs3.notnull()

UBC      False
YorkU     True
UofT      True
UOIT      True
dtype: bool

In [62]:
srs2
srs3
srs3 + srs2

Ryerson         NaN
UBC             NaN
UOIT        70000.0
UofT       120000.0
YorkU       80000.0
dtype: float64

In [63]:
srs2.name = 'number of students'
srs2.index.name = 'University'
srs2

University
Ryerson    25000
UOIT       35000
UofT       60000
YorkU      40000
Name: number of students, dtype: int64

In [64]:
print srs
srs.index = ['Jan', 'Feb', 'Mar', 'Apr', 'May']
print srs

0   -2
1   -3
2    0
3    4
4    7
dtype: int64
Jan   -2
Feb   -3
Mar    0
Apr    4
May    7
dtype: int64

### DataFrame

In [65]:
data = {'Supermarket': ['Metro', 'Metro', 'Metro', 'Walmart', 'Walmart', 'Walmart', ],
        'Year':[2014, 2015, 2016, 2014, 2015, 2016], 
        'Profit(M)':[3.5, 4.8, 4.5, 2.8, 3.6, 4.2] } 
frame = pd.DataFrame(data)

In [66]:
frame

   Profit(M) Supermarket  Year
0        3.5       Metro  2014
1        4.8       Metro  2015
2        4.5       Metro  2016
3        2.8     Walmart  2014
4        3.6     Walmart  2015
5        4.2     Walmart  2016

In [67]:
pd.DataFrame(data, columns = ['Year', 'Supermarket', 'Profit(M)'])

   Year Supermarket  Profit(M)
0  2014       Metro        3.5
1  2015       Metro        4.8
2  2016       Metro        4.5
3  2014     Walmart        2.8
4  2015     Walmart        3.6
5  2016     Walmart        4.2

In [68]:
frame1 = pd.DataFrame(data, 
                      columns = ['Year', 'Supermarket', 'Profit(M)', 'Sales(M)'], 
                      index = ['A', 'B', 'C', 'D', 'E', 'F'])
print frame1.columns
print frame1.Supermarket
print frame1['Profit(M)']
frame1

Index([u'Year', u'Supermarket', u'Profit(M)', u'Sales(M)'], dtype='object')
A      Metro
B      Metro
C      Metro
D    Walmart
E    Walmart
F    Walmart
Name: Supermarket, dtype: object
A    3.5
B    4.8
C    4.5
D    2.8
E    3.6
F    4.2
Name: Profit(M), dtype: float64

   Year Supermarket  Profit(M) Sales(M)
A  2014       Metro        3.5      NaN
B  2015       Metro        4.8      NaN
C  2016       Metro        4.5      NaN
D  2014     Walmart        2.8      NaN
E  2015     Walmart        3.6      NaN
F  2016     Walmart        4.2      NaN

In [69]:
# print a row in the frame
frame1.loc['C']

Year            2016
Supermarket    Metro
Profit(M)        4.5
Sales(M)         NaN
Name: C, dtype: object

In [70]:
frame1['Sales(M)'] = 5
frame1

   Year Supermarket  Profit(M)  Sales(M)
A  2014       Metro        3.5         5
B  2015       Metro        4.8         5
C  2016       Metro        4.5         5
D  2014     Walmart        2.8         5
E  2015     Walmart        3.6         5
F  2016     Walmart        4.2         5

In [71]:
import random
frame1['Sales(M)'] = int(random.random()*100 + 2)
frame1

   Year Supermarket  Profit(M)  Sales(M)
A  2014       Metro        3.5        13
B  2015       Metro        4.8        13
C  2016       Metro        4.5        13
D  2014     Walmart        2.8        13
E  2015     Walmart        3.6        13
F  2016     Walmart        4.2        13

In [72]:
# update the columns on given index
sal = pd.Series([77, 66, 55], index = ['D', 'E', 'F'])
frame1['Sales(M)'] = sal
frame1

   Year Supermarket  Profit(M)  Sales(M)
A  2014       Metro        3.5       NaN
B  2015       Metro        4.8       NaN
C  2016       Metro        4.5       NaN
D  2014     Walmart        2.8      77.0
E  2015     Walmart        3.6      66.0
F  2016     Walmart        4.2      55.0

In [73]:
# add a columns with the values of condition
frame1['Canadain'] = frame1.Supermarket == 'Metro'
frame1

   Year Supermarket  Profit(M)  Sales(M)  Canadain
A  2014       Metro        3.5       NaN      True
B  2015       Metro        4.8       NaN      True
C  2016       Metro        4.5       NaN      True
D  2014     Walmart        2.8      77.0     False
E  2015     Walmart        3.6      66.0     False
F  2016     Walmart        4.2      55.0     False

In [74]:
# delete a columns by name
del frame1['Canadain']
frame1

   Year Supermarket  Profit(M)  Sales(M)
A  2014       Metro        3.5       NaN
B  2015       Metro        4.8       NaN
C  2016       Metro        4.5       NaN
D  2014     Walmart        2.8      77.0
E  2015     Walmart        3.6      66.0
F  2016     Walmart        4.2      55.0

In [75]:
# create a nested dictionary
profit = {'Metro': {2014: 3.5, 2016: 4.5}, 
          'Walmart': {2014: 2.8, 2015: 3.6, 2016: 4.2}}
frame2 = pd.DataFrame(profit)
frame2

      Metro  Walmart
2014    3.5      2.8
2015    NaN      3.6
2016    4.5      4.2

In [76]:
# transpose the table
frame2.T

         2014  2015  2016
Metro     3.5   NaN   4.5
Walmart   2.8   3.6   4.2

In [77]:
# set the year as index
pd.DataFrame(profit, index = [2014, 2015, 2016])

      Metro  Walmart
2014    3.5      2.8
2015    NaN      3.6
2016    4.5      4.2

In [78]:
# make a new dictionary form frame2 by taking the frist 2 rows
pdata = {'Metro': frame2['Metro'][:-1], # all rows form walmart but the last one
         'Walmart': frame2['Walmart'][:2]}# the first 2 rows
pd.DataFrame(pdata)

      Metro  Walmart
2014    3.5      2.8
2015    NaN      3.6

In [79]:
# set the index to year, and name the columns as supermarket
frame2.index.name = '_______Year'
frame2.columns.name = 'Supermarket'
frame2

Supermarket  Metro  Walmart
_______Year
2014           3.5      2.8
2015           NaN      3.6
2016           4.5      4.2

In [80]:
# the value in the frame is contained in an array
frame2.values

array([[ 3.5,  2.8],
       [ nan,  3.6],
       [ 4.5,  4.2]])

In [81]:
frame1.values

array([[2014L, 'Metro', 3.5, nan],
       [2015L, 'Metro', 4.8, nan],
       [2016L, 'Metro', 4.5, nan],
       [2014L, 'Walmart', 2.8, 77.0],
       [2015L, 'Walmart', 3.6, 66.0],
       [2016L, 'Walmart', 4.2, 55.0]], dtype=object)

### index objects

In [82]:
srs = pd.Series(range(4), index = ['A', 'B', 'C', 'D'])
index = srs.index
index

Index([u'A', u'B', u'C', u'D'], dtype='object')

In [83]:
print index[2]
# the index value cannot be updated by assignment
#index[2] = 'F'

C

In [84]:
# create an index
lbl = pd.Index(range(4))
print lbl
# create a series by using the index above
srs1 = pd.Series(['a', 'b', 'c', 'd'], index = lbl)
srs1

Int64Index([0, 1, 2, 3], dtype='int64')

0    a
1    b
2    c
3    d
dtype: object

In [85]:
# check if a column in the frame
print 'Walmart' in frame2.columns
# check if an index in the frame
print 2000 in frame2.index

True
False

In [86]:
# the elemnets in index do not need to be unique
lbl1 = pd.Index(['hello', 'world', 'hello', 'world'])
lbl1

Index([u'hello', u'world', u'hello', u'world'], dtype='object')

### Essential Functionality

In [87]:
srs = pd.Series(['Jan', 'Feb', 'Mar','Apr'], 
                index = ['A', 'B', 'C', 'D'])
srs

A    Jan
B    Feb
C    Mar
D    Apr
dtype: object

In [88]:
srs1 = srs.reindex(['A', 'B', 'C', 'D', 'F'])
srs1

A    Jan
B    Feb
C    Mar
D    Apr
F    NaN
dtype: object

In [89]:
srs2 = pd.Series(['Mon', 'Tue', 'Wed', 'Thu'],
                 index = [0, 3, 4, 7])
srs2
srs2.reindex(range(8), method = 'ffill')

0    Mon
1    Mon
2    Mon
3    Tue
4    Wed
5    Wed
6    Wed
7    Thu
dtype: object

In [90]:
import numpy as np
np.random.seed(80104)

In [91]:
frame = pd.DataFrame(np.arange(16).reshape((4, 4)),
                     index = ['Jan', 'Feb', 'Mar', 'Apr'],
                     columns = ['Mon', 'Tue', 'Wed', 'Thu'])
frame

     Mon  Tue  Wed  Thu
Jan    0    1    2    3
Feb    4    5    6    7
Mar    8    9   10   11
Apr   12   13   14   15

In [92]:
frame2 = frame.reindex(['Jan', 'Feb', 'Mar', 'Apr', 'May'])
frame2

      Mon   Tue   Wed   Thu
Jan   0.0   1.0   2.0   3.0
Feb   4.0   5.0   6.0   7.0
Mar   8.0   9.0  10.0  11.0
Apr  12.0  13.0  14.0  15.0
May   NaN   NaN   NaN   NaN

In [93]:
days = ['Mon', 'Fri', 'Wed', 'Thu']
frame.reindex(columns = days)

     Mon  Fri  Wed  Thu
Jan    0  NaN    2    3
Feb    4  NaN    6    7
Mar    8  NaN   10   11
Apr   12  NaN   14   15

In [94]:
frame.loc[['Jan', 'Feb', 'Mar', 'Apr', 'May'], days]

      Mon  Fri   Wed   Thu
Jan   0.0  NaN   2.0   3.0
Feb   4.0  NaN   6.0   7.0
Mar   8.0  NaN  10.0  11.0
Apr  12.0  NaN  14.0  15.0
May   NaN  NaN   NaN   NaN

#### Dropping Entries form an Axis

In [95]:
# by default this drops index
frame.drop(['Feb', 'Mar', 'Apr'])

     Mon  Tue  Wed  Thu
Jan    0    1    2    3

In [96]:
# it drops columns
frame.drop(['Tue', 'Thu'], axis = 'columns')

     Mon  Wed
Jan    0    2
Feb    4    6
Mar    8   10
Apr   12   14

In [97]:
# it drops index
frame.drop(['Feb', 'Mar'], axis = 'index')

     Mon  Tue  Wed  Thu
Jan    0    1    2    3
Apr   12   13   14   15

In [98]:
# it drops index and columns
frame.drop(['Feb', 'Mar'], axis = 'index').drop(['Tue', 'Thu'], axis = 'columns')

     Mon  Wed
Jan    0    2
Apr   12   14

In [99]:
srs = pd.Series(range(5), index = ['Jan', 'Feb', 'Mar', 'Apr', 'May'])
srs

Jan    0
Feb    1
Mar    2
Apr    3
May    4
dtype: int64

In [100]:
# drop with inplace = True will delete the row in frame
# by default inplace = False
srs.drop(['Jan', 'Feb', 'Mar', 'Apr', 'May'], 
         axis = "index",
         inplace = True)
srs

Series([], dtype: int64)

#### Indexing, Selction, and Filtering

In [101]:
srs = pd.Series(range(9), 
                index = ['A','B','C','D','E','F','G','H','I'])
print srs
print '\nselect the cell by index "B" : ', srs['B']
print '\nselect the cell by index number 2 : ', srs[2]
print '\nselect the cells form 4 to 7: \n', srs[4:8]
print '\nselect the cells by index: \n', srs[['B', 'D', 'F']]
print '\nselect the cells by their values: \n', srs[[3, 5, 8]]
print '\nselect the cells with odd values: \n', srs[srs % 2 == 1]

A    0
B    1
C    2
D    3
E    4
F    5
G    6
H    7
I    8
dtype: int64

select the cell by index "B" :  1

select the cell by index number 2 :  2

select the cells form 4 to 7:
E    4
F    5
G    6
H    7
dtype: int64

select the cells by index:
B    1
D    3
F    5
dtype: int64

select the cells by their values:
D    3
F    5
I    8
dtype: int64

select the cells with odd values:
B    1
D    3
F    5
H    7
dtype: int64

In [102]:
srs['C' : 'G']
# notice that when selecting cells by this, the index has to be unique

C    2
D    3
E    4
F    5
G    6
dtype: int64

In [103]:
# reassign values
srs[srs % 2 == 1] = -1
srs

A    0
B   -1
C    2
D   -1
E    4
F   -1
G    6
H   -1
I    8
dtype: int64

In [104]:
# select data form data frame
data = pd.DataFrame(np.arange(25).reshape(5, 5), 
                    index = ['Jan', 'Feb', 'Mar', 'Apr', 'May'],
                    columns = ['Mon', 'Tue', 'Wed', 'Thu', 'Fri'])
data
data['Mon']
data[['Tue', 'Fri']]

     Tue  Fri
Jan    1    4
Feb    6    9
Mar   11   14
Apr   16   19
May   21   24

In [105]:
data[2:4]

     Mon  Tue  Wed  Thu  Fri
Mar   10   11   12   13   14
Apr   15   16   17   18   19

In [106]:
data[data['Fri'] % 2 == 0]

     Mon  Tue  Wed  Thu  Fri
Jan    0    1    2    3    4
Mar   10   11   12   13   14
May   20   21   22   23   24

In [107]:
data[data % 2 == 0] = 0
data

     Mon  Tue  Wed  Thu  Fri
Jan    0    1    0    3    0
Feb    5    0    7    0    9
Mar    0   11    0   13    0
Apr   15    0   17    0   19
May    0   21    0   23    0

#### Selection with loc and iloc

In [108]:
# .loc accepts index in string
data.loc["Jan", ['Mon', 'Thu']]

Mon    0
Thu    3
Name: Jan, dtype: int32

In [109]:
data.iloc[0, [0, 3]]

Mon    0
Thu    3
Name: Jan, dtype: int32

In [110]:
data.iloc[0]

Mon    0
Tue    1
Wed    0
Thu    3
Fri    0
Name: Jan, dtype: int32

In [111]:
data.iloc[[0, 2, 4], [0, 2, 4]]

     Mon  Wed  Fri
Jan    0    0    0
Mar    0    0    0
May    0    0    0

In [112]:
data[data == 0]

     Mon  Tue  Wed  Thu  Fri
Jan  0.0  NaN  0.0  NaN  0.0
Feb  NaN  0.0  NaN  0.0  NaN
Mar  0.0  NaN  0.0  NaN  0.0
Apr  NaN  0.0  NaN  0.0  NaN
May  0.0  NaN  0.0  NaN  0.0

In [113]:
data.loc['Feb': 'Apr', 'Tue': 'Thu']

     Tue  Wed  Thu
Feb    0    7    0
Mar   11    0   13
Apr    0   17    0

In [114]:
data.iloc[1 : 4 ,  1 : 4]

     Tue  Wed  Thu
Feb    0    7    0
Mar   11    0   13
Apr    0   17    0

In [115]:
data.iloc[1 : 4 ,  1 : 4][data.Wed != 0]

C:\Users\MM\Jupyter_Notebook\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

     Tue  Wed  Thu
Feb    0    7    0
Apr    0   17    0

#### Intefer Indexes

In [116]:
srs = pd.Series(range(5))
srs

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [117]:
srs1 = pd.Series(range(5), index = ['A','B','C','D','E'])
srs1
srs1[-2]
# -2 means the second last element in the series

3

In [118]:
srs[2:]

2    2
3    3
4    4
dtype: int64

In [119]:
srs.loc[2:]

2    2
3    3
4    4
dtype: int64

In [120]:
srs.iloc[2:]
# for the series without specific index, .loc and .iloc are the same

2    2
3    3
4    4
dtype: int64

#### Arithmetic and Data Alignment

In [121]:
A = pd.Series([1.1, 2.2, 3.3, 4.4, 5.5, 6.6, 7.7], 
              index = ['A', 'B', 'C', 'D', 'E', 'F', 'G'])
B = pd.Series([11, 22, 33, 44, 55], 
              index = ['A', 'B', 'C', 'D', 'E'])

In [122]:
A + B

A    12.1
B    24.2
C    36.3
D    48.4
E    60.5
F     NaN
G     NaN
dtype: float64

In [123]:
A - B

A    -9.9
B   -19.8
C   -29.7
D   -39.6
E   -49.5
F     NaN
G     NaN
dtype: float64

In [124]:
A * B

A     12.1
B     48.4
C    108.9
D    193.6
E    302.5
F      NaN
G      NaN
dtype: float64

In [125]:
md1 = pd.DataFrame(np.arange(12).reshape(3, 4), 
                   columns = ['Mon', 'Wed', 'Thu', 'Sta'],
                   index = ['Jan', 'Feb', 'Mar'])
md2 = pd.DataFrame(np.arange(20).reshape(4, 5), 
                   columns = [ 'Tue', 'Wed', 'Thu', 'Fri', 'Sun'],
                   index = ['Jan' , 'Mar', 'May', 'Oct'])
print md1, '\n'
print md2

     Mon  Wed  Thu  Sta
Jan    0    1    2    3
Feb    4    5    6    7
Mar    8    9   10   11

     Tue  Wed  Thu  Fri  Sun
Jan    0    1    2    3    4
Mar    5    6    7    8    9
May   10   11   12   13   14
Oct   15   16   17   18   19

In [126]:
md2 + md1

     Fri  Mon  Sta  Sun   Thu  Tue   Wed
Feb  NaN  NaN  NaN  NaN   NaN  NaN   NaN
Jan  NaN  NaN  NaN  NaN   4.0  NaN   2.0
Mar  NaN  NaN  NaN  NaN  17.0  NaN  15.0
May  NaN  NaN  NaN  NaN   NaN  NaN   NaN
Oct  NaN  NaN  NaN  NaN   NaN  NaN   NaN

In [127]:
df1 = pd.DataFrame({'A': [1, 2, 3],
                    'B': [2, 3, 4],
                    'C': [3, 4, 5]})
df2 =pd.DataFrame({'A': [-1, 2, -3],
                   'B': [2, -3, 4],
                   'C': [-3, 4, -5]})
print df1 + df2
df1 * df2

   A  B  C
0  0  4  0
1  4  0  8
2  0  8  0

   A   B   C
0 -1   4  -9
1  4  -9  16
2 -9  16 -25

In [128]:
df3 = pd.DataFrame({'A': [-1, 2, -3, 4],
                    'B': [2, -3, 4, -5],
                    'C': [-3, 4, -5, 6],
                    'D': [4, -5, 6, -7]})
df1.loc[1, 'B'] = 0
df1

   A  B  C
0  1  2  3
1  2  0  4
2  3  4  5

In [129]:
df1 * df3

     A     B     C   D
0 -1.0   4.0  -9.0 NaN
1  4.0  -0.0  16.0 NaN
2 -9.0  16.0 -25.0 NaN
3  NaN   NaN   NaN NaN

In [130]:
df3.add(df1, fill_value = 100)

       A     B      C      D
0    0.0   4.0    0.0  104.0
1    4.0  -3.0    8.0   95.0
2    0.0   8.0    0.0  106.0
3  104.0  95.0  106.0   93.0

In [131]:
1 / df3

          A         B         C         D
0 -1.000000  0.500000 -0.333333  0.250000
1  0.500000 -0.333333  0.250000 -0.200000
2 -0.333333  0.250000 -0.200000  0.166667
3  0.250000 -0.200000  0.166667 -0.142857

In [132]:
df3.rdiv(1)

          A         B         C         D
0 -1.000000  0.500000 -0.333333  0.250000
1  0.500000 -0.333333  0.250000 -0.200000
2 -0.333333  0.250000 -0.200000  0.166667
3  0.250000 -0.200000  0.166667 -0.142857

In [133]:
df1.reindex(columns = df3.columns, fill_value = 100)

   A  B  C    D
0  1  2  3  100
1  2  0  4  100
2  3  4  5  100

In [134]:
df1.reindex(index = df3.index, columns = df3.columns, fill_value = 100)

     A    B    C    D
0    1    2    3  100
1    2    0    4  100
2    3    4    5  100
3  100  100  100  100

#### Operations between DaraFrame and Series

In [135]:
mx = np.arange(24.).reshape(4, 6)
print mx
print '\n', mx[2]
print '\n', mx * mx[0]

[[  0.   1.   2.   3.   4.   5.]
 [  6.   7.   8.   9.  10.  11.]
 [ 12.  13.  14.  15.  16.  17.]
 [ 18.  19.  20.  21.  22.  23.]]

[ 12.  13.  14.  15.  16.  17.]

[[   0.    1.    4.    9.   16.   25.]
 [   0.    7.   16.   27.   40.   55.]
 [   0.   13.   28.   45.   64.   85.]
 [   0.   19.   40.   63.   88.  115.]]

In [136]:
cldr = pd.DataFrame(np.arange(28).reshape((4, 7)),
                     columns=['Sun', 'Mon', 'Tue', 'Wed', 'Thr', 'Fri', 'Sat'],
                     index=['Week1', 'Week2', 'week3', 'Week4'])
wk = cldr.iloc[1]
print cldr
print '\n'
print wk

       Sun  Mon  Tue  Wed  Thr  Fri  Sat
Week1    0    1    2    3    4    5    6
Week2    7    8    9   10   11   12   13
week3   14   15   16   17   18   19   20
Week4   21   22   23   24   25   26   27


Sun     7
Mon     8
Tue     9
Wed    10
Thr    11
Fri    12
Sat    13
Name: Week2, dtype: int32

In [137]:
cldr - wk

       Sun  Mon  Tue  Wed  Thr  Fri  Sat
Week1   -7   -7   -7   -7   -7   -7   -7
Week2    0    0    0    0    0    0    0
week3    7    7    7    7    7    7    7
Week4   14   14   14   14   14   14   14

In [138]:
wk1 = pd.Series([-10,]*4, index = ['Mon', 'Jan', 'Wed', 'Aug'])
cldr * wk1

       Aug  Fri  Jan    Mon  Sat  Sun  Thr  Tue    Wed
Week1  NaN  NaN  NaN  -10.0  NaN  NaN  NaN  NaN  -30.0
Week2  NaN  NaN  NaN  -80.0  NaN  NaN  NaN  NaN -100.0
week3  NaN  NaN  NaN -150.0  NaN  NaN  NaN  NaN -170.0
Week4  NaN  NaN  NaN -220.0  NaN  NaN  NaN  NaN -240.0

In [139]:
fri = cldr['Fri']
cldr.sub(fri, axis = 'index')

       Sun  Mon  Tue  Wed  Thr  Fri  Sat
Week1   -5   -4   -3   -2   -1    0    1
Week2   -5   -4   -3   -2   -1    0    1
week3   -5   -4   -3   -2   -1    0    1
Week4   -5   -4   -3   -2   -1    0    1

#### Function Applicaiton and Mapping

In [140]:
cldr = pd.DataFrame(np.random.randn(4, 7),
                     columns=['Sun', 'Mon', 'Tue', 'Wed', 'Thr', 'Fri', 'Sat'],
                     index=['Week1', 'Week2', 'week3', 'Week4'])
np.abs(cldr)

            Sun       Mon       Tue       Wed       Thr       Fri       Sat
Week1  0.781800  1.966767  0.110266  1.456624  0.041139  0.999583  0.984061
Week2  0.645209  0.212817  1.175442  0.224563  1.318153  1.674435  1.127824
week3  0.946099  0.873487  0.642237  0.626787  0.591347  0.251540  0.845552
Week4  0.752570  1.233222  0.341793  0.566092  0.619538  0.893648  1.803554

In [141]:
avg = lambda x: sum(x) / len(x)
cldr.apply(avg) # by default the function is excuted on index vector

Sun   -0.308370
Mon    0.088190
Tue   -0.020287
Wed    0.323189
Thr   -0.326301
Fri   -0.117584
Sat    0.767472
dtype: float64

In [142]:
cldr.apply(avg, axis = 'columns')

Week1   -0.165152
Week2   -0.049756
week3    0.368981
Week4    0.078103
dtype: float64

In [143]:
def f(x):
    return pd.Series([x.min(), x.max()], index = ['Min', 'Max'])
cldr.apply(f)

          Sun       Mon       Tue       Wed       Thr       Fri       Sat
Min -0.781800 -1.966767 -1.175442 -0.566092 -1.318153 -0.999583 -0.845552
Max  0.946099  1.233222  0.642237  1.456624  0.591347  1.674435  1.803554

In [144]:
cldr.apply(f, axis = 'columns')

            Min       Max
Week1 -1.966767  1.456624
Week2 -1.318153  1.674435
week3 -0.845552  0.946099
Week4 -0.893648  1.803554

In [145]:
intg = lambda x: x * 100
format = lambda x: '%d%%' % x
cldr.apply(intg).applymap(format)

        Sun    Mon    Tue   Wed    Thr   Fri   Sat
Week1  -78%  -196%    11%  145%     4%  -99%   98%
Week2  -64%    21%  -117%  -22%  -131%  167%  112%
week3   94%    87%    64%   62%    59%  -25%  -84%
Week4  -75%   123%    34%  -56%   -61%  -89%  180%

In [146]:
cldr['Mon'].apply(intg).map(format)

Week1    -196%
Week2      21%
week3      87%
Week4     123%
Name: Mon, dtype: object

#### Sorting and Ranking

In [147]:
wk = pd.Series(range(7), 
               index = ['Sun', 'Mon', 'Tue', 'Wed', 'Thr', 'Fri', 'Sat'])
wk.sort_index()

Fri    5
Mon    1
Sat    6
Sun    0
Thr    4
Tue    2
Wed    3
dtype: int64

In [148]:
cldr = pd.DataFrame(np.arange(28).reshape((4, 7)),
                     columns=['Sun', 'Mon', 'Tue', 'Wed', 'Thr', 'Fri', 'Sat'],
                     index=['Jan', 'Feb', 'Mar', 'Apr'])
cldr

     Sun  Mon  Tue  Wed  Thr  Fri  Sat
Jan    0    1    2    3    4    5    6
Feb    7    8    9   10   11   12   13
Mar   14   15   16   17   18   19   20
Apr   21   22   23   24   25   26   27

In [149]:
cldr.sort_index()

     Sun  Mon  Tue  Wed  Thr  Fri  Sat
Apr   21   22   23   24   25   26   27
Feb    7    8    9   10   11   12   13
Jan    0    1    2    3    4    5    6
Mar   14   15   16   17   18   19   20

In [150]:
cldr.sort_index(axis = 1)
# when axis = 1 that means to sort by columns

     Fri  Mon  Sat  Sun  Thr  Tue  Wed
Jan    5    1    6    0    4    2    3
Feb   12    8   13    7   11    9   10
Mar   19   15   20   14   18   16   17
Apr   26   22   27   21   25   23   24

In [151]:
cldr.sort_index(axis = 1, ascending = False)

     Wed  Tue  Thr  Sun  Sat  Mon  Fri
Jan    3    2    4    0    6    1    5
Feb   10    9   11    7   13    8   12
Mar   17   16   18   14   20   15   19
Apr   24   23   25   21   27   22   26

In [152]:
srs = pd.Series(cldr.sort_index(axis = 1).iloc[1])
srs

Fri    12
Mon     8
Sat    13
Sun     7
Thr    11
Tue     9
Wed    10
Name: Feb, dtype: int32

In [153]:
srs.sort_values()

Sun     7
Mon     8
Tue     9
Wed    10
Thr    11
Fri    12
Sat    13
Name: Feb, dtype: int32

In [154]:
cldr = pd.DataFrame(np.random.randint(0, 6, size = (4, 7)),
                     columns=['Sun', 'Mon', 'Tue', 'Wed', 'Thr', 'Fri', 'Sat'],
                     index=['Jan', 'Feb', 'Mar', 'Apr'])
cldr

     Sun  Mon  Tue  Wed  Thr  Fri  Sat
Jan    5    5    0    3    3    3    2
Feb    3    0    0    5    1    0    0
Mar    4    5    3    5    3    0    2
Apr    5    2    1    5    2    0    2

In [155]:
cldr.sort_values(by = ['Wed'])

     Sun  Mon  Tue  Wed  Thr  Fri  Sat
Jan    5    5    0    3    3    3    2
Feb    3    0    0    5    1    0    0
Mar    4    5    3    5    3    0    2
Apr    5    2    1    5    2    0    2

In [156]:
cldr.sort_values(by = ['Wed', 'Sat'])

     Sun  Mon  Tue  Wed  Thr  Fri  Sat
Jan    5    5    0    3    3    3    2
Feb    3    0    0    5    1    0    0
Mar    4    5    3    5    3    0    2
Apr    5    2    1    5    2    0    2

In [157]:
cldr = pd.DataFrame(np.random.randint(0, 7, size = (7, 1)),
                     index = ['Sun', 'Mon', 'Tue', 'Wed', 'Thr', 'Fri', 'Sat'])
cldr

     0
Sun  6
Mon  0
Tue  0
Wed  6
Thr  6
Fri  0
Sat  2

In [158]:
cldr.columns = ['Rank']
cldr.rank()

     Rank
Sun   6.0
Mon   2.0
Tue   2.0
Wed   6.0
Thr   6.0
Fri   2.0
Sat   4.0

In [159]:
cldr.rank(method = 'first')

     Rank
Sun   5.0
Mon   1.0
Tue   2.0
Wed   6.0
Thr   7.0
Fri   3.0
Sat   4.0

In [160]:
cldr.rank(ascending = False, method = 'max')

     Rank
Sun   3.0
Mon   7.0
Tue   7.0
Wed   3.0
Thr   3.0
Fri   7.0
Sat   4.0

In [161]:
cldr = pd.DataFrame(np.random.randint(0, 6, size = (4, 7)),
                     columns=['Sun', 'Mon', 'Tue', 'Wed', 'Thr', 'Fri', 'Sat'],
                     index=['Jan', 'Feb', 'Mar', 'Apr'])
cldr

     Sun  Mon  Tue  Wed  Thr  Fri  Sat
Jan    3    3    3    4    4    1    2
Feb    3    4    2    4    0    3    3
Mar    2    3    3    4    2    5    5
Apr    4    5    1    5    4    2    3

In [162]:
cldr.rank(axis = 'columns')

     Sun  Mon  Tue  Wed  Thr  Fri  Sat
Jan  4.0  4.0  4.0  6.5  6.5  1.0  2.0
Feb  4.0  6.5  2.0  6.5  1.0  4.0  4.0
Mar  1.5  3.5  3.5  5.0  1.5  6.5  6.5
Apr  4.5  6.5  1.0  6.5  4.5  2.0  3.0

-------------------------------------------------------------------------------

-------------------------------------------------------------------------------

-------------------------------------------------------------------------------

-------------------------------------------------------------------------------